'''
5. (МОДУЛЬ 2) создать модуль 2seq.py. Задание:
Пользователь вводит любые цифры через запятую
Сохранить цифры в список
Получить новый список в котором будут только уникальные элементы исходного (уникальным считается символ, который встречается в исходном списке только 1 раз)
Вывести новый список на экран
Порядок цифр в новом списке не важен
Пример работы: Введите элементы списка через запятую: 2,3,4,5,5,6,5,3,9
Результат: 2, 4, 6, 9

(Дополнительно*) Предусмотреть что пользователь может использовать один из 3-х разделителей: запятую, точку с запятой, слэш (1,2,3 1;2;3 1/2/3), но только какой то один 1,2;3/4 - так нельзя
'''
inp_line = input('Введите элементы списка через разделитель (запятую, точку с запятой или слэш): ')
sep = ',' if ',' in inp_line else ';' if  ';' in inp_line else '/'
digits = [int(x) for x in inp_line.split(sep)]
uniq_digits = [x for x in digits if digits.count(x) == 1]
print(*uniq_digits, sep=', ')
